circuitvalley/mipi_dsi_bridge_fpga/USB_Controller/Source/src/system_config/pic32mz_ef_sk_int_dyn/framework/peripheral/usb/processor/usb_p32mx470f512h.h
PLIB_INLINE_API bool PLIB_USB_ExistsDeviceAddress(USB_MODULE_ID index)
{
     return USB_ExistsDeviceAddress_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_USB_FrameNumberGet(USB_MODULE_ID index)
{
     return USB_FrameNumberGet_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsFrameNumber(USB_MODULE_ID index)
{
     return USB_ExistsFrameNumber_Default(index);
}

PLIB_INLINE_API USB_PID PLIB_USB_TokenPIDGet(USB_MODULE_ID index)
{
     return USB_TokenPIDGet_Default(index);
}

PLIB_INLINE_API void PLIB_USB_TokenPIDSet(USB_MODULE_ID index, USB_PID pidValue)
{
     USB_TokenPIDSet_Default(index, pidValue);
}

PLIB_INLINE_API void PLIB_USB_TokenSend(USB_MODULE_ID index, USB_PID pidValue, uint8_t endpoint, uint8_t deviceAddress, bool isLowSpeed)
{
     USB_TokenSend_Default(index, pidValue, endpoint, deviceAddress, isLowSpeed);
}

PLIB_INLINE_API bool PLIB_USB_ExistsTokenPID(USB_MODULE_ID index)
{
     return USB_ExistsTokenPID_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_USB_TokenEPGet(USB_MODULE_ID index)
{
     return USB_TokenEPGet_Default(index);
}

PLIB_INLINE_API void PLIB_USB_TokenEPSet(USB_MODULE_ID index, uint8_t epValue)
{
     USB_TokenEPSet_Default(index, epValue);
}

PLIB_INLINE_API bool PLIB_USB_ExistsTokenEP(USB_MODULE_ID index)
{
     return USB_ExistsTokenEP_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_USB_SOFThresholdGet(USB_MODULE_ID index)
{
     return USB_SOFThresholdGet_Default(index);
}

PLIB_INLINE_API void PLIB_USB_SOFThresholdSet(USB_MODULE_ID index, uint8_t threshold)
{
     USB_SOFThresholdSet_Default(index, threshold);
}

PLIB_INLINE_API bool PLIB_USB_ExistsSOFThreshold(USB_MODULE_ID index)
{
     return USB_ExistsSOFThreshold_Default(index);
}

PLIB_INLINE_API void* PLIB_USB_BDTBaseAddressGet(USB_MODULE_ID index)
{
     return USB_BDTBaseAddressGet_Default(index);
}

PLIB_INLINE_API void PLIB_USB_BDTBaseAddressSet(USB_MODULE_ID index, void* address)
{
     USB_BDTBaseAddressSet_Default(index, address);
}

PLIB_INLINE_API bool PLIB_USB_ExistsBDTBaseAddress(USB_MODULE_ID index)
{
     return USB_ExistsBDTBaseAddress_Default(index);
}

PLIB_INLINE_API void PLIB_USB_EyePatternDisable(USB_MODULE_ID index)
{
     USB_EyePatternDisable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_EyePatternEnable(USB_MODULE_ID index)
{
     USB_EyePatternEnable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsEyePattern(USB_MODULE_ID index)
{
     return USB_ExistsEyePattern_Default(index);
}

PLIB_INLINE_API void PLIB_USB_StopInIdleEnable(USB_MODULE_ID index)
{
     USB_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_StopInIdleDisable(USB_MODULE_ID index)
{
     USB_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsStopInIdle(USB_MODULE_ID index)
{
     return USB_ExistsStopInIdle_Default(index);
}

PLIB_INLINE_API void PLIB_USB_AutoSuspendDisable(USB_MODULE_ID index)
{
     USB_AutoSuspendDisable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_AutoSuspendEnable(USB_MODULE_ID index)
{
     USB_AutoSuspendEnable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsAutomaticSuspend(USB_MODULE_ID index)
{
     return USB_ExistsAutomaticSuspend_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_PingPongModeSelect(USB_MODULE_ID index, USB_PING_PONG_MODE ppConfig)
{
     USB_PingPongModeSelect_Unsupported(index, ppConfig);
}

PLIB_INLINE_API USB_PING_PONG_MODE _PLIB_UNSUPPORTED PLIB_USB_PingPongModeGet(USB_MODULE_ID index)
{
     return USB_PingPongModeGet_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsPingPongMode(USB_MODULE_ID index)
{
     return USB_ExistsPingPongMode_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_UOEMonitorEnable(USB_MODULE_ID index)
{
     USB_UOEMonitorEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_UOEMonitorDisable(USB_MODULE_ID index)
{
     USB_UOEMonitorDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsUOEMonitor(USB_MODULE_ID index)
{
     return USB_ExistsUOEMonitor_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_OnChipPullUpEnable(USB_MODULE_ID index)
{
     USB_OnChipPullUpEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_OnChipPullUpDisable(USB_MODULE_ID index)
{
     USB_OnChipPullUpDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOnChipPullup(USB_MODULE_ID index)
{
     return USB_ExistsOnChipPullup_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TransceiverEnable(USB_MODULE_ID index)
{
     USB_TransceiverEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TransceiverDisable(USB_MODULE_ID index)
{
     USB_TransceiverDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsOnChipTransceiver(USB_MODULE_ID index)
{
     return USB_ExistsOnChipTransceiver_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_FullSpeedEnable(USB_MODULE_ID index)
{
     USB_FullSpeedEnable_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_FullSpeedDisable(USB_MODULE_ID index)
{
     USB_FullSpeedDisable_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsSpeedControl(USB_MODULE_ID index)
{
     return USB_ExistsSpeedControl_Unsupported(index);
}

PLIB_INLINE_API void PLIB_USB_EP0LSDirectConnectEnable(USB_MODULE_ID index)
{
     USB_EP0LSDirectConnectEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_EP0LSDirectConnectDisable(USB_MODULE_ID index)
{
     USB_EP0LSDirectConnectDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsEP0LowSpeedConnect(USB_MODULE_ID index)
{
     return USB_ExistsEP0LowSpeedConnect_Default(index);
}

PLIB_INLINE_API void PLIB_USB_EP0NakRetryEnable(USB_MODULE_ID index)
{
     USB_EP0NakRetryEnable_Default(index);
}

PLIB_INLINE_API void PLIB_USB_EP0NakRetryDisable(USB_MODULE_ID index)
{
     USB_EP0NakRetryDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_USB_ExistsEP0NAKRetry(USB_MODULE_ID index)
{
     return USB_ExistsEP0NAKRetry_Default(index);
}

